app/Filters/LoginFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $db = db_connect();
        $user = $db->table('user')->getWhere([])->getRow();
---
SELECT *
FROM `user`