app/Views/layout/back-end/main.php

SELECT *
FROM `store`
---
  <meta content="width=device-width, initial-scale=1, maximum-scale=1, shrink-to-fit=no" name="viewport">
  <?php
    $db = db_connect();
    $query = $db->table('store')->getWhere([])->getRow();