app/Views/layout/back-end/sidebar.php

SELECT *
FROM `store`
---
    <?php
        $db = db_connect();
        $request = \Config\Services::request();
        $query = $db->table('store')->getWhere([])->getRow();