app/Views/layout/back-end/topbar.php

SELECT *
FROM `user`
WHERE `id` = '1'
---
            <?php
              $id = session('id');
              $db = db_connect();
              $user = $db->table('user')->getWhere(['id' => $id])->getRow();