app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `telephone` = '083825287989'
---
    public function proccess()
    {
        $post = $this->request->getPost();
        $query = $this->db->table('user')->getWhere(['telephone' => $post['no_hp']]);