app/Controllers/Home.php

SELECT *
FROM `product`
WHERE `slug` = 'kaos-polos'
SELECT *
FROM `discount`
SELECT *
FROM `size`
WHERE `product_id` = '7'
SELECT *
FROM `color`
WHERE `product_id` = '7'
---
    public function detail($slug)
    {
        $query = $this->product->getWhere(['slug' => $slug])->getRow();

        $product_id = $query->id;

        $data = [
            'product' => $query,
            'brand' => $this->brand->findAll(),
            'discount' => $this->discount->findAll(),
            'size' => $this->size->where('product_id', $product_id)->get()->getResultArray(),
            'color' => $this->color->where('product_id', $product_id)->get()->getResultArray(),

SELECT *
FROM `user`
WHERE `username` = 'mirwansyahs'
---
    public function profile($username)
    {
        $data['user'] = $this->profile->getWhere(['username' => $username])->getRow();

UPDATE `user` SET `first_name` = 'Mohammad', `last_name` = 'Irwansyah Somantri', `telephone` = '083825287989', `email` = 'mirwansyah1933@gmail.com', `image` = 'mirwansyahs.png', `modified_at` = '2022-08-09 13:37:48'
WHERE `user`.`id` IN ('mirwansyahs')
---
            'modified_at' => Time::now('Asia/Jakarta', 'en_ID')
        ];

        $this->profile->update($username, $params);