app/Controllers/Setting.php

SELECT *
FROM `user`
---
    public function index()
    {
        $query = $this->db->table('user')->getWhere([]);