app/Models/ChatModel.php

    function getList()
    {
        $builder = $this->db->table('message_latest');
        $builder->join('message', 'message.id = message_latest.message_id');
        $builder->join('user', 'user.id = message.user_id');
        $builder->orderBy('time_in', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `message_latest`
JOIN `message` ON `message`.`id` = `message_latest`.`message_id`
JOIN `user` ON `user`.`id` = `message`.`user_id`
ORDER BY `time_in` DESC