app/Views/layout/front-end/main.php

    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <?php
    $db = db_connect();
    $query = $db->table('store')->getWhere([])->getRow();
---
SELECT *
FROM `store`

                            <?php
                            $id = session('id');
                            $db = db_connect();
                            $user = $db->table('user')->getWhere(['id' => $id])->getRow();
---
SELECT *
FROM `user`
WHERE `id` = '5'

        <div class="container">
            <?php
            $db = db_connect();
            $query = $db->table('store')->getWhere([])->getRow();
---
SELECT *
FROM `store`